mcushilei/UCPF/pedestals/mcu/arm/cortex_m0/nxp/lpc12xx/common/uart/reg_uart.h
#ifndef __I_IO_UART_H__
#define __I_IO_UART_H__

/*============================ INCLUDES ======================================*/
/*============================ MACROS ========================================*/
#define UART0_REG                      (*(volatile uart_reg_t *)UART0_BASE_ADDRESS)
#define UART1_REG                      (*(volatile uart_reg_t *)UART1_BASE_ADDRESS)

/*============================ MACROFIED FUNCTIONS ===========================*/
#define UART_RBR0                      0
#define UART_RBR1                      1
#define UART_RBR2                      2
#define UART_RBR3                      3
#define UART_RBR4                      4
#define UART_RBR5                      5
#define UART_RBR6                      6
#define UART_RBR7                      7
#define UART_RBR_MSK                  (   (1 << UART_RBR0) | \
                                            (1 << UART_RBR1) | \
                                            (1 << UART_RBR2) | \
                                            (1 << UART_RBR3) | \
                                            (1 << UART_RBR4) | \
                                            (1 << UART_RBR5) | \
                                            (1 << UART_RBR6) | \
                                            (1 << UART_RBR7)) 
#define UART_RBR_SET(__VAL)            ((__VAL) << UART_RBR0)


#define UART_THR0                      0
#define UART_THR1                      1
#define UART_THR2                      2
#define UART_THR3                      3
#define UART_THR4                      4
#define UART_THR5                      5
#define UART_THR6                      6
#define UART_THR7                      7
#define UART_THR_MSK                  (   (1 << UART_THR0) | \
                                            (1 << UART_THR1) | \
                                            (1 << UART_THR2) | \
                                            (1 << UART_THR3) | \
                                            (1 << UART_THR4) | \
                                            (1 << UART_THR5) | \
                                            (1 << UART_THR6) | \
                                            (1 << UART_THR7))
#define UART_THR_SET(__VAL)            ((__VAL) << UART_THR0)


#define UART_DLLSB0                    0
#define UART_DLLSB1                    1
#define UART_DLLSB2                    2
#define UART_DLLSB3                    3
#define UART_DLLSB4                    4
#define UART_DLLSB5                    5
#define UART_DLLSB6                    6
#define UART_DLLSB7                    7
#define UART_DLLSB_MSK                (   (1 << UART_DLLSB0) | \
                                            (1 << UART_DLLSB1) | \
                                            (1 << UART_DLLSB2) | \
                                            (1 << UART_DLLSB3) | \
                                            (1 << UART_DLLSB4) | \
                                            (1 << UART_DLLSB5) | \
                                            (1 << UART_DLLSB6) | \
                                            (1 << UART_DLLSB7))
#define UART_DLLSB_SET(__VAL)          ((__VAL) << UART_DLLSB0)


#define UART_DLMSB0                    0
#define UART_DLMSB1                    1
#define UART_DLMSB2                    2
#define UART_DLMSB3                    3
#define UART_DLMSB4                    4
#define UART_DLMSB5                    5
#define UART_DLMSB6                    6
#define UART_DLMSB7                    7
#define UART_DLMSB_MSK                (   (1 << UART_DLMSB0) | \
                                            (1 << UART_DLMSB1) | \
                                            (1 << UART_DLMSB2) | \
                                            (1 << UART_DLMSB3) | \
                                            (1 << UART_DLMSB4) | \
                                            (1 << UART_DLMSB5) | \
                                            (1 << UART_DLMSB6) | \
                                            (1 << UART_DLMSB7))
#define UART_DLMSB_SET(__VAL)          ((__VAL) << UART_DLMSB0)


#define UART_IER_RBRIE                 0     
#define UART_IER_RBRIE_MSK            (1 << UART_IER_RBRIE)     
#define UART_IER_RBRIE_SET(__VAL)      ((__VAL) << UART_IER_RBRIE)     

#define UART_IER_THREIE                1 
#define UART_IER_THREIE_MSK           (1 << UART_IER_THREIE)    
#define UART_IER_THREIE_SET(__VAL)     ((__VAL) << UART_IER_THREIE)    

#define UART_IER_RXIE                  2 
#define UART_IER_RXIE_MSK             (1 << UART_IER_RXIE)      
#define UART_IER_RXIE_SET(__VAL)       ((__VAL) << UART_IER_RXIE)   

#define UART_IER_MSINTEN               3 
#define UART_IER_MSINTEN_MSK          (1 << UART_IER_MSINTEN)      
#define UART_IER_MSINTENE_SET(__VAL)   ((__VAL) << UART_IER_MSINTEN) 

#define UART_IER_CTSINTEN              7 
#define UART_IER_CTSINTEN_MSK         (1 << UART_IER_CTSINTEN)      
#define UART_IER_CTSINTEN_SET(__VAL)   ((__VAL) << UART_IER_CTSINTEN) 

#define UART_IER_ABEOINTEN             8 
#define UART_IER_ABEOINTEN_MSK        (1 << UART_IER_ABEOINTEN) 
#define UART_IER_ABEOINTEN_SET(__VAL)  ((__VAL) << UART_IER_ABEOINTEN) 

#define UART_IER_ABTOINTEN             9 
#define UART_IER_ABTOINTEN_MSK        (1 << UART_IER_ABTOINTEN) 
#define UART_IER_ABTOINTEN_SET(__VAL)  ((__VAL) << UART_IER_ABTOINTEN) 

#define UART_IER_WAKEUPINTEN               10 
#define UART_IER_WAKEUPINTEN_MSK          (1 << UART_IER_WAKEUPINTEN) 
#define UART_IER_WAKEUPINTEN_SET(__VAL)    ((__VAL) << UART_IER_WAKEUPINTEN) 


#define UART_IIR_INTSTATUS	            0
#define UART_IIR_INTSTATUS_MSK        (1 << UART_IIR_INTSTATUS)
#define UART_IIR_INTSTATUS_SET(VALUE)  ((__VAL) << UART_IIR_INTSTATUS)

#define UART_IIR_INTID0                1
#define UART_IIR_INTID1                2
#define UART_IIR_INTID2                3
#define UART_IIR_INTID_MSK            (   (1 << UART_IIR_INTID0) | \
                                            (1 << UART_IIR_INTID1) | \
                                            (1 << UART_IIR_INTID2))
#define UART_IIR_INTID_SET(__VAL)      ((__VAL) << UART_IIR_INTID0)       

#define UART_IIR_INTID_RLS	            ((3u << UART_IIR_INTID0))
#define UART_IIR_INTID_RDA	            ((2u << UART_IIR_INTID0))
#define UART_IIR_INTID_CTI	            ((6u << UART_IIR_INTID0))
#define UART_IIR_INTID_THRE	        ((1u << UART_IIR_INTID0))

