mcushilei/UCPF/pedestals/mcu/arm/cortex_m0/nxp/lpc12xx/common/uart/reg_uart.h
#define UART_IIR_FIFOENABLE0           6
#define UART_IIR_FIFOENABLE1           7
#define UART_IIR_FIFOENABLE_MSK       (   (1 << UART_IIR_FIFOENABLE0) | \
                                            (1 << UART_IIR_FIFOENABLE0))
#define UART_IIR_FIFOENABLE_SET(__VAL) ((__VAL) << UART_IIR_FIFOENABLE0)  

#define UART_IIR_ABEOINT               8
#define UART_IIR_ABEOINT_MSK          (1 << UART_IIR_ABEOINT)     
#define UART_IIR_ABEOINT_SET(__VAL)    ((__VAL) << UART_IIR_ABEOINT)     

#define UART_IIR_ABTOINT               9 
#define UART_IIR_ABTOINT_MSK          (1 << UART_IIR_ABTOINT)     
#define UART_IIR_ABTOINT_SET(__VAL)    ((__VAL) << UART_IIR_ABTOINT)     

#define UART_IIR_WAKEUPINT               10 
#define UART_IIR_WAKEUPINT_MSK          (1 << UART_IIR_WAKEUPINT)     
#define UART_IIR_WAKEUPINT_SET(__VAL)    ((__VAL) << UART_IIR_WAKEUPINT)    
          

#define UART_FCR_FIFO_EN               0
#define UART_FCR_FIFO_EN_MSK          (1<<UART_FCR_FIFO_EN)
#define UART_FCR_FIFO_EN_SET(__VAL)    ((__VAL) << UART_FCR_FIFO_EN)

#define UART_FCR_RX_FIFO_RS            1
#define UART_FCR_RX_FIFO_RS_MSK       (1<<UART_FCR_RX_FIFO_RS)
#define UART_FCR_RX_FIFO_RS_SET(__VAL) ((__VAL) << UART_FCR_RX_FIFO_RS)

#define UART_FCR_TX_FIFO_RS            2
#define UART_FCR_TX_FIFO_RS_MSK       (1<<UART_FCR_TX_FIFO_RS)
#define UART_FCR_TX_FIFO_RS_SET(__VAL) ((__VAL) << UART_FCR_TX_FIFO_RS)

#define UART_FCR_DMA_MO                3
#define UART_FCR_DMA_MO_MSK           (1<<UART_FCR_DMA_MO)
#define UART_FCR_DMA_MO_SET(__VAL)     ((__VAL) << UART_FCR_DMA_MO)

#define UART_FCR_RXTL0                 6
#define UART_FCR_RXTL1                 7
#define UART_FCR_RTXL_MSK             (   (1<<UART_FCR_RXTL0) | \
                                            (1<<UART_FCR_RXTL1))
#define UART_FCR_RXTL_SET(__VAL)       ((__VAL) << UART_FCR_RXTL0)


#define UART_BIT_LENGTH_5              0x0
#define UART_BIT_LENGTH_6              0x1
#define UART_BIT_LENGTH_7              0x2
#define UART_BIT_LENGTH_8              0x3

#define UART_LCR_WLS0                  0
#define UART_LCR_WLS1                  1
#define UART_LCR_WLS_MSK              (   (1<<UART_LCR_WLS0)| \
                                            (1<<UART_LCR_WLS1))
#define UART_LCR_WLS_SET(__VAL)        ((__VAL) << UART_LCR_WLS0)                                 
#define UART0_BIT_LENGTH(__LENGTH)      ((__LENGTH) << UART_BIT_LENGTH_5)

#define UART_LCR_SBS                   2
#define UART_LCR_SBS_MSK              (1<<UART_LCR_SBS)
#define UART_LCR_SBS_SET(__VAL)        ((__VAL) << UART_LCR_SBS)

#define UART_LCR_PE                    3
#define UART_LCR_PE_MSK               (1<<UART_LCR_PE)
#define UART_LCR_PE_SET(__VAL)         ((__VAL) << UART_LCR_PE)

#define UART_LCR_PS0                   4
#define UART_LCR_PS1                   5
#define UART_LCR_PS_MSK               (   (1<<UART_LCR_PS0) | \
                                            (1<<UART_LCR_PS1))
#define UART_LCR_PS_SET(__VAL)         ((__VAL) << UART_LCR_PS0)

#define UART_LCR_BC                    6
#define UART_LCR_BC_MSK               (1<<UART_LCR_BC)
#define UART_LCR_BC_SET(__VAL)         ((__VAL) << UART_LCR_BC)

#define UART_LCR_DLAB                  7
#define UART_LCR_DLAB_MSK             (1<<UART_LCR_DLAB)
#define UART_LCR_DLAB_SET(__VAL)       ((__VAL << UART_LCR_DLAB))


#define UART_MCR_DTRCTR                0
#define UART_MCR_DTRCTR_MSK           (1 << UART_MCR_DTRCTR)
#define UART_MCR_DTRCTR_SET(__VAL)     ((__VAL) << UART_MCR_DTRCTR)

#define UART_MCR_RTSCTR                1
#define UART_MCR_RTSCTR_MSK           (1 << UART_MCR_RTSCTR)
#define UART_MCR_RTSCTR_SET(__VAL)     ((__VAL) << UART_MCR_RTSCTR)

#define UART_MCR_OUT1                  2
#define UART_MCR_OUT1_MSK             (1 << UART_MCR_OUT1)
#define UART_MCR_OUT1_SET(__VAL)       ((__VAL) << UART_MCR_OUT1)

#define UART_MCR_OUT2                  3
#define UART_MCR_OUT2_MSK             (1 << UART_MCR_OUT2)
#define UART_MCR_OUT2_SET(__VAL)       ((__VAL) << UART_MCR_OUT2)

#define UART_MCR_LMS                   4
#define UART_MCR_LMS_MSK              (1<<UART_MCR_LMS)
#define UART_MCR_LMS_SET(__VAL)        ((__VAL) << UART_MCR_LMS)  

#define UART_MCR_RTSEN                 6
#define UART_MCR_RTSEN_MSK            (1<<UART_MCR_RTSEN)
#define UART_MCR_RTSEN_SET(__VAL)      ((__VAL) << UART_MCR_RTSEN)

#define UART_MCR_CTSEN                 7
#define UART_MCR_CTSEN_MSK            (1<<UART_MCR_CTSEN)
#define UART_MCR_CTSEN_SET(__VAL)      ((__VAL) << UART_MCR_CTSEN)


#define UART_LSR_RDR                   0
#define UART_LSR_RDR_MSK              (1<<UART_LSR_RDR)
#define UART_LSR_RDR_SET(__VAL)        ((__VAL) << UART_LSR_RDR)

#define UART_LSR_OE                    1
#define UART_LSR_OE_MSK               (1<<UART_LSR_OE)
#define UART_LSR_OE_SET(__VAL)         ((__VAL) << UART_LSR_OE)

#define UART_LSR_PE                    2
#define UART_LSR_PE_MSK               (1<<UART_LSR_PE)
#define UART_LSR_PE_SET(__VAL)         ((__VAL) << UART_LSR_PE)

#define UART_LSR_FE                    3
#define UART_LSR_FE_MSK               (1<<UART_LSR_FE)
#define UART_LSR_FE_SET(__VAL)         ((__VAL) << UART_LSR_FE)

#define UART_LSR_BI                    4
#define UART_LSR_BI_MSK               (1<<UART_LSR_BI)
#define UART_LSR_BI_SET(__VAL)         ((__VAL) << UART_LSR_BI)

#define UART_LSR_THRE                  5
#define UART_LSR_THRE_MSK             (1<<UART_LSR_THRE)
#define UART_LSR_THRE_SET(__VAL)       ((__VAL) << UART_LSR_THRE)

#define UART_LSR_TEMT                  6
#define UART_LSR_TEMT_MSK             (1<<UART_LSR_TEMT)
#define UART_LSR_TEMT_SET(__VAL)       ((__VAL) << UART_LSR_TEMT)

#define UART_LSR_RXFE                  7
#define UART_LSR_RXFE_MSK             (1<<UART_LSR_RXFE)
#define UART_LSR_RXFE_SET(__VAL)       ((__VAL) << UART_LSR_RXFE)

#define UART_LSR_TXERR                 8 
#define UART_LSR_TXERR_MSK            (1 << UART_LSR_TXERR)
#define UART_LSR_TXERR_SET(__VAL)      ((__VAL) << UART_LSR_TXERR)


#define UART_MSR_DCTS                  0
#define UART_MSR_DCTS_MSK             (1<<UART_MSR_DCTS)
#define UART_MSR_DCTS_SET(__VAL)       ((__VAL) << UART_MSR_DCTS)

#define UART_MSR_DDSR                  1
#define UART_MSR_DDSR_MSK             (1<<UART_MSR_DDSR)
#define UART_MSR_DDSR_SET(__VAL)       ((__VAL) << UART_MSR_DDSR)

#define UART_MSR_TERI                  2
#define UART_MSR_TERI_MSK             (1<<UART_MSR_TERI)
#define UART_MSR_TERI_SET(__VAL)       ((__VAL) << UART_MSR_TERI)

#define UART_MSR_DDCD                  3
#define UART_MSR_DDCD_MSK             (1<<UART_MSR_DDCD)
#define UART_MSR_DDCD_SET(__VAL)       ((__VAL) << UART_MSR_DDCD)

#define UART_MSR_CTS                   4
#define UART_MSR_CTS_MSK              (1<<UART_MSR_CTS)
#define UART_MSR_CTS_SET(__VAL)        ((__VAL) << UART_MSR_CTS)

