mcushilei/UCPF/pedestals/mcu/arm/cortex_m0/nxp/lpc12xx/common/uart/reg_uart.h
#define UART_MSR_DSR                   5
#define UART_MSR_DSR_MAKS              (1<<UART_MSR_DSR)
#define UART_MSR_DSR_SET(__VAL)        ((__VAL) << UART_MSR_DSR)

#define UART_MSR_RI                    6
#define UART_MSR_RI_MSK               (1<<UART_MSR_RI)
#define UART_MSR_RI_SET(__VAL)         ((__VAL) << UART_MSR_RI)

#define UART_MSR_DCD                   7
#define UART_MSR_DCD_MSK              (1<<UART_MSR_DCD)
#define UART_MSR_DCD_SET(__VAL)        ((__VAL) << UART_MSR_DCD)


#define UART_SCR_PAD0                  0
#define UART_SCR_PAD1                  1
#define UART_SCR_PAD2                  2
#define UART_SCR_PAD3                  3
#define UART_SCR_PAD4                  4
#define UART_SCR_PAD5                  5
#define UART_SCR_PAD6                  6
#define UART_SCR_PAD7                  7
#define UART_SCR_PAD_MSK              (   (1 << UART_SCR_PAD0) | \
                                            (1 << UART_SCR_PAD1) | \
                                            (1 << UART_SCR_PAD2) | \
                                            (1 << UART_SCR_PAD3) | \
                                            (1 << UART_SCR_PAD4) | \
                                            (1 << UART_SCR_PAD5) | \
                                            (1 << UART_SCR_PAD6) | \
                                            (1 << UART_SCR_PAD7))
#define UART_SCR_PAD_SET(__VAL)        ((__VAL) << UART_SCR_PAD0)


#define UART_ACR_AUTO_BAUD_START       0
#define UART_ACR_AUTO_BAUD_START_MSK  (1<<UART_ACR_AUTO_BAUD_START)

#define UART_ACR_MODE                  1
#define UART_ACR_MODE_MSK             (1<<UART_ACR_MODE)

#define UART_ACR_AUTO_RESTART          2
#define UART_ACR_AUTO_RESTART_MSK     (1<<UART_ACR_AUTO_RESTART)

#define UART_ACR_ABEOINTCLR            8
#define UART_ACR_ABEOINTCLR_MSK       (1<<UART_ACR_ABEOINTCLR)

#define UART_ACR_ABTOINTCLR            9
#define UART_ACR_ABTOINTCLR_MSK       (1<<UART_ACR_ABTOINTCLR)


#define UART_IRDAEN                    0 
#define UART_IRDAEN_MSK               (1 << UART_IRDAEN)      
#define UART_IRDAEN_SET(__VAL)         ((__VAL) << UART_IRDAEN)      

#define UART_IRDAINV                   1
#define UART_IRDAINV_MSK              (1 << UART_IRDAINV)      
#define UART_IRDAINV_SET(__VAL)        ((__VAL) << UART_IRDAINV)      


#define UART_RS485CTRL_NMMEN               0
#define UART_RS485CTRL_NMMEN_MSK          (1<<UART_RS485CTRL_NMMEN)
#define UART_RS485CTRL_NMMEN_SET(__VAL)    ((__VAL) << UART_RS485CTRL_NMMEN) 

#define UART_RS485CTRL_RXDIS               1
#define UART_RS485CTRL_RXDIS_MSK          (1<<UART_RS485CTRL_RXDIS)
#define UART_RS485CTRL_RXDIS_SET(__VAL)    ((__VAL) << UART_RS485CTRL_RXDIS)

#define UART_RS485CTRL_AADEN               2
#define UART_RS485CTRL_AADEN_MSK          (1<<UART_RS485CTRL_AADEN)
#define UART_RS485CTRL_AADEN_SET(__VAL)    ((__VAL) << UART_RS485CTRL_AADEN)

#define UART_RS485CTRL_SEL                 3
#define UART_RS485CTRL_SEL_MSK            (1<<UART_RS485CTRL_SEL)
#define UART_RS485CTRL_SEL_SET(__VAL)      ((__VAL) << UART_RS485CTRL_SEL)

#define UART_RS485CTRL_DCTRL               4
#define UART_RS485CTRL_DCTRL_MSK          (1<<UART_RS485CTRL_DCTRL)
#define UART_RS485CTRL_DCTRL_SET(__VAL)    ((__VAL) << UART_RS485CTRL_DCTRL)

#define UART_RS485CTRL_OINV                5
#define UART_RS485CTRL_OINV_MSK           (1<<UART_RS485CTRL_OINV)
#define UART_RS485CTRL_OINV_SET(__VAL)     ((__VAL) << UART_RS485CTRL_OINV)


#define UART_RS485ADRMATCH0           0
#define UART_RS485ADRMATCH1           1
#define UART_RS485ADRMATCH2           2
#define UART_RS485ADRMATCH3           3
#define UART_RS485ADRMATCH4           4
#define UART_RS485ADRMATCH5           5
#define UART_RS485ADRMATCH6           6
#define UART_RS485ADRMATCH7           7
#define UART_RS485ADRMATCH_MSK       ((1<<UART_RS485ADRMATCH0) | \
                                        (1<<UART_RS485ADRMATCH1)  | \
                                        (1<<UART_RS485ADRMATCH2)  | \
                                        (1<<UART_RS485ADRMATCH3)  | \
                                        (1<<UART_RS485ADRMATCH4)  | \
                                        (1<<UART_RS485ADRMATCH5)  | \
                                        (1<<UART_RS485ADRMATCH6)  | \
                                        (1<<UART_RS485ADRMATCH7))

#define UART_RE485ADRMATCH(__VALUE)   ((__VALUE) << UART_RS485ADRMATCH0)


#define UART_RS485_DLY0                0
#define UART_RS485_DLY1                1
#define UART_RS485_DLY2                2
#define UART_RS485_DLY3                3
#define UART_RS485_DLY4                4
#define UART_RS485_DLY5                5
#define UART_RS485_DLY6                6
#define UART_RS485_DLY7                7
#define UART_RS485_DLY_MSK            ((1<<UART_RS485_DLY0) | \
                                        (1<<UART_RS485_DLY1)  | \
                                        (1<<UART_RS485_DLY2)  | \
                                        (1<<UART_RS485_DLY3)  | \
                                        (1<<UART_RS485_DLY4)  | \
                                        (1<<UART_RS485_DLY5)  | \
                                        (1<<UART_RS485_DLY6)  | \
                                        (1<<UART_RS485_DLY7))
#define UART_RS485_DLY_VALUE(__VALUE)  ((__VALUE) << UART_RS485_DLY0)


//! UART TER TXEN 
#define UART_TER_TXEN                      7
#define UART_TER_TXEN_MSK                 (1<<UART_TER_TXEN)
#define UART_TER_TXEN_SET(__VAL)           ((__VAL) << UART_TER_TXEN)



#define UART_FIFOLVL_RX_BIT0           0
#define UART_FIFOLVL_RX_MSK            (0x0fu << UART_FIFOLVL_RX_BIT0)
#define UART_FIFOLVL_TX_BIT0           8
#define UART_FIFOLVL_TX_MSK            (0x0fu << UART_FIFOLVL_TX_BIT0)

/*============================ TYPES =========================================*/
//! UART REGISTER PAGE TYPE 
//! \name uart_t
//! @{
typedef struct {
    union {
        //!< Receiver Buffer Register
        DEF_REG32
            reg32_t RBR         :8;                     //!< Receiver Buffer Register
            reg32_t             :24;                    //!< Reserved
        END_DEF_REG32(RBR)

        //!< Transmit Holding Register
        DEF_REG32
            reg32_t THR         :8;                     //!< Transmit Holding Register
            reg32_t             :24;                    //!< Reserved
        END_DEF_REG32(THR)

        //!< Divisor Latch LSB
        DEF_REG32
            reg32_t DLLSB       :8;                     //!< Divisor Latch LSB
            reg32_t             :24;                    //!< Reserved
        END_DEF_REG32(DLL)
    };  
    
    union {
        //!< Divisor Latch MSB
        DEF_REG32
            reg32_t DLMSB       :8;                     //!< Divisor Latch MSB
            reg32_t             :24;                    //!< Reserved
        END_DEF_REG32(DLM)

        //!< Interrupt Enable Register
        DEF_REG32
            reg32_t RBRIE       :1;                     //!< RBR Interrupt Enable
            reg32_t THREIE      :1;                     //!< THRE Interrupt Enable
            reg32_t RXIE        :1;                     //!< RX Line Interrupt Enable
            reg32_t MSINtEn     :1;                     //!< Modem Status interrupt enable
            reg32_t             :3;                     //!< Reserved
            reg32_t CTSIntEn    :1;                     //!< CTS Interrupt Enable
            reg32_t ABEOINTEN   :1;                     //!< Enables the end of auto-baud interrupt
            reg32_t ABTOINTEN   :1;                     //!< Enables the auto-baud time-out interrupt
            reg32_t WakeUpIntEn :1;                     //!< Wake-up Interrupt Enable
            reg32_t             :21;                    //!< Reserved
        END_DEF_REG32(IER)
    };
    
    union {
        //!< Interrupt ID Register
        DEF_REG32
            reg32_t INTSTATUS	:1;                     //!< Interrupt status
            reg32_t INTID       :3;                     //!< Interrupt identification                          
            reg32_t             :2;                     //!< Reserved           
            reg32_t FIFOENABLE  :2;                     //!< Copies of FCR[0]              
            reg32_t ABEOINT     :1;                     //!< End of auto-baud interrupt               
            reg32_t ABTOINT     :1;                     //!< Auto-baud time-out interrupt           
            reg32_t WAKEUPINT   :1;                     //!< Wake-up interrupt           
            reg32_t             :21;                    //!< Reserved
        END_DEF_REG32(IIR)

        //!< FIFO Control Register
        DEF_REG32
            reg32_t FIFOEN      :1;                     //!< FIFO Enable
            reg32_t RXFIFORS    :1;                     //!< RX FIFO Reset
            reg32_t TXFIFORS    :1;                     //!< TX FIFO Reset 
            reg32_t DMAMO       :1;                     //!< DMA Mode Select
            reg32_t             :2;                     //!< Reserved
            reg32_t RXTL        :2;                     //!< RX Trigger Level
            reg32_t             :24;                    //!< Reserved
        END_DEF_REG32(FCR)
    };
    
    //!< Line Control Register    
    DEF_REG32
        reg32_t WLS             :2;                     //!< Word Length Select   
        reg32_t SBS             :1;                     //!< Stop Bit Select   
        reg32_t PE              :1;                     //!< Parity Enable   
        reg32_t PS              :2;                     //!< Parity Select   
        reg32_t BC              :1;                     //!< Break Control
        reg32_t DLAB            :1;                     //!< Divisor Latch Access Bit   
        reg32_t                 :24;                    //!< Reserved
    END_DEF_REG32(LCR)

    //!< Modem Control Register 
    DEF_REG32
        reg32_t DTRCTR          :1;                     //!< DTR Control 
        reg32_t RTSCTR          :1;                     //!< RTS Control
        reg32_t OUT1            :1;                     //!< Inverse control for the out1_an output
        reg32_t OUT2            :1;                     //!< Inverse control for the out2_an outputs
        reg32_t LMS             :1;                     //!< Loopback Mode Select
        reg32_t                 :1;                     //!< Reserved
        reg32_t RTSEN           :1;                     //!< RTS enable
        reg32_t CTSEN           :1;                     //!< CTS enable
        reg32_t                 :24;                    //!< Reserved        
    END_DEF_REG32(MCR)

