mcushilei/UCPF/pedestals/mcu/arm/cortex_m0/nxp/lpc12xx/common/uart/reg_uart.h
    //!< Line Status Register  
    DEF_REG32
        reg32_t RDR             :1;                     //!< Receiver Data Ready
        reg32_t OE              :1;                     //!< Overrun Error
        reg32_t PE              :1;                     //!< Parity Error
        reg32_t FE              :1;                     //!< Framing Error
        reg32_t BI              :1;                     //!< Break Interrupt
        reg32_t THRE            :1;                     //!< Transmitter Holding Register Empty
        reg32_t TEMT            :1;                     //!< Transmitter Empty
        reg32_t RXFE            :1;                     //!< Error in RX FIFO
        reg32_t TXERR           :1;                     //!< Error in transmitted character
        reg32_t                 :23;                    //!< Reserved
    END_DEF_REG32(LSR)

    //!< Modem Status Register   
    DEF_REG32
        reg32_t DCTS            :1;                     //!< Delta CTS
        reg32_t DDSR            :1;                     //!< Delta DSR
        reg32_t TERI            :1;                     //!< Trailing Edge RI
        reg32_t DDCD            :1;                     //!< Delta DCD
        reg32_t CTS             :1;                     //!< Clear To Send State 
        reg32_t DSR             :1;                     //!< Data Set Ready State 
        reg32_t RI              :1;                     //!< Ring Indicator State
        reg32_t DCD             :1;                     //!< Data Carrier Detect State
        reg32_t                 :24;                    //!< Reserved
    END_DEF_REG32(MSR)

    //!< Scratch Pad Register
    DEF_REG32
        reg32_t PAD             :8;                     //!< Scratch pad. A readable, writable byte
        reg32_t                 :24;                    //!< Reserved         
    END_DEF_REG32(SCR)

    //!< Auto-baud Control Register
    DEF_REG32
        reg32_t START           :1;                      //!< Start bit
        reg32_t MODE            :1;                      //!< Auto-baud mode select bit
        reg32_t AUTORESTART     :1;                      //!< Restart bit
        reg32_t                 :5;                      //!< Reserved
        reg32_t ABEOINTCLR      :1;                      //!< End of auto-baud interrupt clear bit (write-only)
        reg32_t ABTOINTCLR      :1;                      //!< Auto-baud time-out interrupt clear bit (write-only)
        reg32_t                 :22;                     //!< Reserved
    END_DEF_REG32(ACR)

    //!< IrDA control register
    DEF_REG32
        reg32_t IRDAEN          :1;                     //!< IrDA mode enable                               
        reg32_t IRDAINV         :1;                     //!< Serial input direction                
        reg32_t FIXPULSEEN      :1;                     //!< IrDA fixed pulse width mode                
        reg32_t PULSEDIV        :3;                     //!< Configures the pulse when FixPulseEn = 1      
        reg32_t                 :26;                    //!< Reserved
    END_DEF_REG32(ICR)

    //!< Fractional Divider Register
    DEF_REG32
        reg32_t DIVADDVAL       :4;                     //!< Baud rate generation pre-scaler divisor value.
        reg32_t MULVAL          :4;                     //!< Baud rate pre-scaler multiplier value.
        reg32_t                 :24;                    //!< Reserved
    END_DEF_REG32(FDR)

    REG32_RSVD(1)                   //!< Reserved

    //! Transmit Enable Register
    DEF_REG32
        reg32_t                 :7;                     //!< Reserved
        reg32_t TXEN            :1;                     //!< Transmit enable     
        reg32_t                 :24;                    //!< Reserved
    END_DEF_REG32(TER)

    REG32_RSVD(6)                   //!< Reserved

    //!< RS-485/EIA-485 Control
    DEF_REG32
        reg32_t NMMEN           :1;                     //!< NMM enable
        reg32_t RXDIS           :1;                     //!< Receiver enable
        reg32_t AADEN           :1;                     //!< AAD enable
        reg32_t SEL             :1;                     //!< Reserved
        reg32_t DCTRL           :1;                     //!< Direction control for DIR pin
        reg32_t OINV            :1;                     //!< Direction control pin polarity
        reg32_t                 :26;                    //!< Reserved
    END_DEF_REG32(RS485CTRL)

    //!< RS-485/EIA-485 address match
    DEF_REG32
        reg32_t ADRMATCH        :8;                     //!< Contains the address match value
        reg32_t                 :24;                    //!< Reserved
    END_DEF_REG32(RS485ADRMATCH)

    //!< RS-485/EIA-485 direction control delay               
    DEF_REG32
        reg32_t DLY             :8;                     //!< Contains the direction control delay value    
        reg32_t                 :24;                    //!< Reserved
    END_DEF_REG32(RS485DLY)
    
    //! FIFO level register
//    DEF_REG32
//        reg32_t RXFIFOLVL       :4;                     //!< current level of the UART receiver FIFO
//        reg32_t                 :4;                     //!< Reserved
//        reg32_t TXFIFOLVL       :4;                     //!< current level of the UART transmitter FIFO
//        reg32_t                 :20;                    //!< Reserved        
//    END_DEF_REG32(FIFOLVL)

} uart_reg_t;
//! @}

/*============================ GLOBAL VARIABLES ==============================*/
/*============================ PROTOTYPES ====================================*/

#endif 
